Revit 2027 API
BuiltInFailures.WallFailures.CurtainOrStackedWallDisallowedForCrossSectionType Property
 Curtain wall types and Stacked wall types are not allowed for this wall's cross-section type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CurtainOrStackedWallDisallowedForCrossSectionType { get; }
Public Shared ReadOnly Property CurtainOrStackedWallDisallowedForCrossSectionType As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CurtainOrStackedWallDisallowedForCrossSectionType {
	FailureDefinitionId^ get ();
}
static member CurtainOrStackedWallDisallowedForCrossSectionType : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace